Raw-wrk-files/run-2/fortune/aspnet-mono-mysql-raw/raw
Welcome to Ubuntu 12.04.3 LTS (GNU/Linux 3.9.0-030900-generic x86_64)

 * Documentation:  https://help.ubuntu.com/

  System information as of Wed Oct 16 18:09:41 PDT 2013

  System load:  0.05               Processes:           118
  Usage of /:   5.8% of 129.62GB   Users logged in:     0
  Memory usage: 1%                 IP address for eth1: 172.16.98.98
  Swap usage:   0%

  Graph this data and manage this system at https://landscape.canonical.com/

58 packages can be updated.
19 updates are security updates.


---------------------------------------------------------
 Running Primer aspnet-mono-mysql-raw
 wrk -H 'Host: localhost' -H 'Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8' -H 'Connection: keep-alive' -d 5 -c 8 -t 8 http://172.16.98.122:8080/ado/mysql/fortunes
---------------------------------------------------------

Running 5s test @ http://172.16.98.122:8080/ado/mysql/fortunes
  8 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    37.58ms  110.61ms 414.99ms   92.00%
    Req/Sec     7.47     53.44   750.00     97.56%
  456 requests in 6.00s, 2.47MB read
  Socket errors: connect 0, read 2, write 0, timeout 14
  Non-2xx or 3xx responses: 118
Requests/sec:     75.99
Transfer/sec:    421.44KB

---------------------------------------------------------
 Running Warmup aspnet-mono-mysql-raw
 wrk -H 'Host: localhost' -H 'Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://172.16.98.122:8080/ado/mysql/fortunes
---------------------------------------------------------

Running 15s test @ http://172.16.98.122:8080/ado/mysql/fortunes
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.86s     2.56s    8.97s    89.80%
    Req/Sec    57.44    102.03   387.00     81.46%
  7731 requests in 16.01s, 27.13MB read
  Socket errors: connect 0, read 95, write 0, timeout 1656
  Non-2xx or 3xx responses: 3784
Requests/sec:    483.02
Transfer/sec:      1.70MB

---------------------------------------------------------
 Concurrency: 8 for aspnet-mono-mysql-raw
 wrk -H 'Host: localhost' -H 'Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8' -H 'Connection: keep-alive'  -d 15 -c 8 -t 8 http://172.16.98.122:8080/ado/mysql/fortunes
---------------------------------------------------------

Running 15s test @ http://172.16.98.122:8080/ado/mysql/fortunes
  8 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    58.83ms  142.84ms 409.59ms   85.51%
    Req/Sec    12.64     63.39   461.00     96.03%
  1410 requests in 16.01s, 6.98MB read
  Socket errors: connect 0, read 2, write 0, timeout 50
  Non-2xx or 3xx responses: 441
Requests/sec:     88.10
Transfer/sec:    446.77KB

---------------------------------------------------------
 Concurrency: 16 for aspnet-mono-mysql-raw
 wrk -H 'Host: localhost' -H 'Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8' -H 'Connection: keep-alive'  -d 15 -c 16 -t 8 http://172.16.98.122:8080/ado/mysql/fortunes
---------------------------------------------------------

Running 15s test @ http://172.16.98.122:8080/ado/mysql/fortunes
  8 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    33.48ms   86.28ms 316.85ms   91.31%
    Req/Sec    13.49     68.44     0.88k    95.74%
  2265 requests in 16.00s, 9.63MB read
  Socket errors: connect 0, read 9, write 0, timeout 104
  Non-2xx or 3xx responses: 810
Requests/sec:    141.54
Transfer/sec:    616.50KB

---------------------------------------------------------
 Concurrency: 32 for aspnet-mono-mysql-raw
 wrk -H 'Host: localhost' -H 'Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8' -H 'Connection: keep-alive'  -d 15 -c 32 -t 8 http://172.16.98.122:8080/ado/mysql/fortunes
---------------------------------------------------------

Running 15s test @ http://172.16.98.122:8080/ado/mysql/fortunes
  8 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    70.91ms   85.86ms 251.43ms   81.12%
    Req/Sec     9.89     49.14   666.00     95.53%
  1981 requests in 16.00s, 8.60MB read
  Socket errors: connect 0, read 6, write 0, timeout 214
  Non-2xx or 3xx responses: 938
Requests/sec:    123.81
Transfer/sec:    550.68KB

---------------------------------------------------------
 Concurrency: 64 for aspnet-mono-mysql-raw
 wrk -H 'Host: localhost' -H 'Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8' -H 'Connection: keep-alive'  -d 15 -c 64 -t 8 http://172.16.98.122:8080/ado/mysql/fortunes
---------------------------------------------------------

Running 15s test @ http://172.16.98.122:8080/ado/mysql/fortunes
  8 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    74.01ms   49.02ms 288.51ms   86.16%
    Req/Sec    12.13     50.83   492.00     94.26%
  2237 requests in 16.00s, 9.24MB read
  Socket errors: connect 0, read 33, write 0, timeout 435
  Non-2xx or 3xx responses: 1182
Requests/sec:    139.80
Transfer/sec:    591.54KB

---------------------------------------------------------
 Concurrency: 128 for aspnet-mono-mysql-raw
 wrk -H 'Host: localhost' -H 'Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8' -H 'Connection: keep-alive'  -d 15 -c 128 -t 8 http://172.16.98.122:8080/ado/mysql/fortunes
---------------------------------------------------------

Running 15s test @ http://172.16.98.122:8080/ado/mysql/fortunes
  8 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   165.19ms   97.13ms 351.15ms   70.42%
    Req/Sec    31.41     81.25   398.00     89.44%
  4859 requests in 16.00s, 16.75MB read
  Socket errors: connect 0, read 54, write 0, timeout 877
  Non-2xx or 3xx responses: 2281
Requests/sec:    303.63
Transfer/sec:      1.05MB

---------------------------------------------------------
 Concurrency: 256 for aspnet-mono-mysql-raw
 wrk -H 'Host: localhost' -H 'Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8' -H 'Connection: keep-alive'  -d 15 -c 256 -t 8 http://172.16.98.122:8080/ado/mysql/fortunes
---------------------------------------------------------

Running 15s test @ http://172.16.98.122:8080/ado/mysql/fortunes
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   812.70ms  430.73ms   1.15s    81.82%
    Req/Sec    38.87     91.76   402.00     85.38%
  5685 requests in 16.00s, 12.08MB read
  Socket errors: connect 0, read 82, write 0, timeout 1683
  Non-2xx or 3xx responses: 4012
Requests/sec:    355.21
Transfer/sec:    772.78KB